Revit 2024 API
ExternalFileReference.ExternalFileReferenceType Property
 The type of external file which this object references.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public ExternalFileReferenceType ExternalFileReferenceType { get; }
Visual Basic
Public ReadOnly Property ExternalFileReferenceType As ExternalFileReferenceType
	Get
Visual C++
public:
property ExternalFileReferenceType ExternalFileReferenceType {
	ExternalFileReferenceType get ();
}
See Also
ExternalFileReference Class
Autodesk.Revit.DB Namespace